bin/Debug/Resources/Log/ReplicaStock_20052026_151440.log

[20/05/2026 | 15:14:40 ] [INFO] Se encontraron 6 registros en ST_NOVEDADES_STOCK.
[20/05/2026 | 15:14:40 ] [INFO] Se encontraron 2 registros en ST_NOVEDADES_STOCK.
[20/05/2026 | 15:14:41 ] [INFO] Request a enviar: <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://services.business.soap.bridge.synthesis.com/">
                                       <soapenv:Header/>
                                       <soapenv:Body>
                                          <ser:execute>
                                             <service>stock</service>
                                             <request><![CDATA[
                                                <bridgeCoreRequest>
                                                    <operation>createOrUpdate</operation>
                                                    <params>
                                             <stocks type="list"><stock type="bean"><storeCode>1327</storeCode><locationCode>1200</locationCode><itemInventoryState>IISD</itemInventoryState><revenueCenter>RCD</revenueCenter><items type="list"><item type="bean"><itemCode>X31800399101</itemCode><stockUnits>126</stockUnits></item><item type="bean"><itemCode>X31800418101AA</itemCode><stockUnits>9</stockUnits></item><item type="bean"><itemCode>X31800399101</itemCode><stockUnits>126</stockUnits></item><item type="bean"><itemCode>X31800418101AA</itemCode><stockUnits>9</stockUnits></item><item type="bean"><itemCode>X202020</itemCode><stockUnits>153</stockUnits></item><item type="bean"><itemCode>X20203</itemCode><stockUnits>148</stockUnits></item></items></stock><stock type="bean"><storeCode>1327</storeCode><locationCode>1201</locationCode><itemInventoryState>IISD</itemInventoryState><revenueCenter>RCD</revenueCenter><items type="list"><item type="bean"><itemCode>X202020</itemCode><stockUnits>153</stockUnits></item><item type="bean"><itemCode>X20203</itemCode><stockUnits>148</stockUnits></item></items></stock></stocks>
                                                    </params>
                                                </bridgeCoreRequest>
                                             ]]></request>
                                             <store>0</store>
                                          </ser:execute>
                                       </soapenv:Body>
                                    </soapenv:Envelope>
[20/05/2026 | 15:14:56 ] [INFO] No se importaron algunos registros
[20/05/2026 | 15:14:56 ] [INFO] Error en ítem código: X31800418101AA - Detalle: El item con codigo X31800418101AA no existe
